PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_gpio.h
#if (defined (CY_IP_MXS40SIOSS) && (CPUSS_CM33_0_SECEXT_PRESENT != 0)) || defined (CY_IP_MXS22IOSS)
/*******************************************************************************
* Function Name: Cy_GPIO_GetSecureInterruptCause0
****************************************************************************//**
*
* Returns the interrupt status for ports 0 to 31.
*
* \return
* 0 = Interrupt not detected on port
* 1 = Interrupt detected on port
*
* \note
* This API is available for devices that support TrustZone.
* \funcusage
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_GPIO_GetSecureInterruptCause0(void)
{
    return (GPIO_SEC_INTR_CAUSE0);
}


/*******************************************************************************
* Function Name: Cy_GPIO_GetSecureInterruptCause1
****************************************************************************//**
*
* Returns the interrupt status for ports 32 to 63.
*
* \return
* 0 = Interrupt not detected on port
* 1 = Interrupt detected on port
*
* \note
* This API is available for devices that support TrustZone.
*
* \funcusage
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_GPIO_GetSecureInterruptCause1(void)
{
    return (GPIO_SEC_INTR_CAUSE1);
}


/*******************************************************************************
* Function Name: Cy_GPIO_GetSecureInterruptCause2
****************************************************************************//**
*
* Returns the interrupt status for ports 64 to 95.
*
* \return
* 0 = Interrupt not detected on port
* 1 = Interrupt detected on port
*
* \note
* This API is available for devices that support TrustZone.
*
* \funcusage
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_GPIO_GetSecureInterruptCause2(void)
{
    return (GPIO_SEC_INTR_CAUSE2);
}


/*******************************************************************************
* Function Name: Cy_GPIO_GetSecureInterruptCause3
****************************************************************************//**
*
* Returns the interrupt status for ports 96 to 127.
*
* \return
* 0 = Interrupt not detected on port
* 1 = Interrupt detected on port
*
* \note
* This API is available for devices that support TrustZone.
*
* \funcusage
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_GPIO_GetSecureInterruptCause3(void)
{
    return (GPIO_SEC_INTR_CAUSE3);
}
#endif /* CY_IP_MXS40SIOSS, CPUSS_CM33_0_SECEXT_PRESENT, CY_IP_MXS22IOSS */

/** \} group_gpio_functions_interrupt */

/** \} group_gpio_functions */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS40SIOSS, CY_IP_MXS40IOSS, CY_IP_MXS22IOSS */

#endif /* CY_GPIO_H */

/** \} group_gpio */

/* [] END OF FILE */
